# Day09.py
# 1. 元组（不可变的list）
我的位置 = (10, 20) # 元组用圆括号，一旦定义不能改,刻石头上
print(f"坐标是：{我的位置}")

# 2. 解包赋值（交换）
a = "张三"
b = "李四"
a, b = b, a # 交换！现在a是李四，b是张三, 灵魂交换
print(f"交换后：a={a}, b={b}")

# 3. 引用 vs 复制（大坑！）
原名单 = ["张三", "李四"]
新名单 = 原名单 # 这是引用！一栋房子两把钥匙
新名单.append("王五")
print(f"原名单也被改了：{原名单}") # 你会看到王五也进了原名单! 房子被装修了, 无论那把钥匙开都是装修后的房子

# 正确复制的方法：
正确的新名单 = 原名单.copy() # 用 .copy() 才是真正的复制, 建新房子
正确的新名单.append("赵六")
print(f"这下原名单没变：{原名单}")  # 2个不同的房子, 原名单无赵六

# 4. zip配对遍历
名字 = ["张三", "李四", "王五"]
分数 = [88, 95, 60]
for 名字, 分数 in zip(名字, 分数):  # 连线题, 同时打印
    print(f"{名字} 考了 {分数} 分")