# Day10.py
# 定义第一个函数：算平均分
def 算平均分(成绩列表):  # 参数是成绩列表
    总分 = sum(成绩列表)
    平均分 = 总分 / len(成绩列表)
    return 平均分 # 返回计算结果

# 定义第二个函数：数不及格人数
def 数不及格(成绩列表):
    不及格名单 = []  # 局部变量，只在这个函数里面活着（不污染外面）
    for 分数 in 成绩列表:
        if 分数 < 60:
            不及格名单.append(分数)
    return 不及格名单 # 返回一个列表

# 定义第三个函数： 找最高分
def 找最高分(成绩列表):
    最高分 = max(成绩列表)
    return 最高分

# 定义第四个函数：打印总结报告,门面函数: 统筹和输出(组装厂)
def 打印报告(成绩列表):
    avg = 算平均分(成绩列表)  # 调用第一个函数
    不及格 = 数不及格(成绩列表)  # 调用第二个函数
    最高分 = 找最高分(成绩列表)  # 调用第三个函数
    print(f"平均分是：{avg}")
    print(f"不及格名单：{不及格}")
    print(f"最高分是:{最高分}")

# 主程序（真正的起点）
我的成绩 = [88, 95, 60, 72, 45, 30, 90]
打印报告(我的成绩) # 调用函数跑起来  三个核心函数 / 一个主控函数